import java.time.LocalDateTime;

// Вывести в консоль системные дату и время

public class task002 {
    public static void main(String[] args) {
        System.out.println(LocalDateTime.now());
    }
}
